app/services/order_conversations_service.rb

SELECT "group_conversations".* FROM "group_conversations" INNER JOIN "group_conversations_users" ON "group_conversations"."id" = "group_conversations_users"."conversation_id" WHERE "group_conversations_users"."user_id" = $1  [["user_id", 12]]
---
    def call
        all_private_conversations = Private::Conversation.all_by_user(@user.id)
                                                        .includes(:messages)
        all_group_conversations = @user.group_conversations.includes(:messages)