app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
---
    def index
        @posts = Post.limit(5)