app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 101], ["LIMIT", 1]]
---
    def show
       @post = Post.find_by(id: params[:id].to_i)